RoboMaster/ArduinoCore-imxrt/variants/ai_hub/source/slot_factory_test.c
/**
 * @file slot_factory_test.c
 * @author Zhenling Pan(ryan.pan@dji.com)
 * @brief 14Pin插座和100Pin插座工厂测试用,将IO成对测试,
 *        一发一收测试.需要使用回环陪测板.
 * @version 0.1
 * @date 2021-12-14
 *
 * @copyright Copyright (c) 2021
 *
 */

#include "slot_factory_test.h"
#include "fsl_iomuxc.h"
#include "MIMXRT1064.h"
#include "fsl_gpio.h"
#include "cmsis_os.h"

/* Private define ------------------------------------------------------------*/
#define SLOT100_BOARD_INITPINS_IOMUXC_GPR_GPR26_GPIO_MUX1_GPIO_SEL_MASK 0x083CF008U /*!< GPIO1 and GPIO6 share same IO MUX function, GPIO_MUX1 selects one GPIO function: affected bits mask */
#define SLOT100_BOARD_INITPINS_IOMUXC_GPR_GPR27_GPIO_MUX2_GPIO_SEL_MASK 0x0FFFFFFFU /*!< GPIO2 and GPIO7 share same IO MUX function, GPIO_MUX2 selects one GPIO function: affected bits mask */
#define SLOT100_BOARD_INITPINS_IOMUXC_GPR_GPR28_GPIO_MUX3_GPIO_SEL_MASK 0x0D3C0FC0U /*!< GPIO3 and GPIO8 share same IO MUX function, GPIO_MUX3 selects one GPIO function: affected bits mask */
#define SLOT100_BOARD_INITPINS_IOMUXC_GPR_GPR29_GPIO_MUX4_GPIO_SEL_MASK 0xFFFFFFFFU /*!< GPIO4 and GPIO9 share same IO MUX function, GPIO_MUX4 selects one GPIO function: affected bits mask */

#define SLOT14_BOARD_INITPINS_IOMUXC_GPR_GPR26_GPIO_MUX1_GPIO_SEL_MASK 0xF0C00000U  /*!< GPIO1 and GPIO6 share same IO MUX function, GPIO_MUX1 selects one GPIO function: affected bits mask */
#define SLOT14_BOARD_INITPINS_IOMUXC_GPR_GPR28_GPIO_MUX3_GPIO_SEL_MASK 0x34U        /*!< GPIO3 and GPIO8 share same IO MUX function, GPIO_MUX3 selects one GPIO function: affected bits mask */

#define SLOT14_T1_PORT                                        COMPRESS_GPIO1   /*!< PORT peripheral base pointer */
#define SLOT14_T1_PIN                                         28U   /*!< PORT pin number */

#define SLOT14_T2_PORT                                        COMPRESS_GPIO3   /*!< PORT peripheral base pointer */
#define SLOT14_T2_PIN                                         2U   /*!< PORT pin number */

#define SLOT14_T3_PORT                                        COMPRESS_GPIO1   /*!< PORT peripheral base pointer */
#define SLOT14_T3_PIN                                         30U   /*!< PORT pin number */

#define SLOT14_T4_PORT                                        COMPRESS_GPIO3   /*!< PORT peripheral base pointer */
#define SLOT14_T4_PIN                                         5U   /*!< PORT pin number */

#define SLOT14_T5_PORT                                        COMPRESS_GPIO3   /*!< PORT peripheral base pointer */
#define SLOT14_T5_PIN                                         4U   /*!< PORT pin number */

#define SLOT14_T6_PORT                                        COMPRESS_GPIO1   /*!< PORT peripheral base pointer */
#define SLOT14_T6_PIN                                         31U   /*!< PORT pin number */

#define SLOT14_T8_PORT                                        COMPRESS_GPIO1   /*!< PORT peripheral base pointer */
#define SLOT14_T8_PIN                                         29U   /*!< PORT pin number */

#define SLOT14_T9_PORT                                        COMPRESS_GPIO1   /*!< PORT peripheral base pointer */
#define SLOT14_T9_PIN                                         23U   /*!< PORT pin number */

#define SLOT14_T10_PORT                                       COMPRESS_GPIO1   /*!< PORT peripheral base pointer */
#define SLOT14_T10_PIN                                        22U   /*!< PORT pin number */

#define SLOT100_T5_PORT                                       COMPRESS_GPIO1   /*!< PORT peripheral base pointer */
#define SLOT100_T5_PIN                                        12U   /*!< PORT pin number */

#define SLOT100_T6_PORT                                       COMPRESS_GPIO1   /*!< PORT peripheral base pointer */
#define SLOT100_T6_PIN                                        13U   /*!< PORT pin number */

#define SLOT100_T7_PORT                                       COMPRESS_GPIO1   /*!< PORT peripheral base pointer */
#define SLOT100_T7_PIN                                        14U   /*!< PORT pin number */

#define SLOT100_T8_PORT                                       COMPRESS_GPIO1   /*!< PORT peripheral base pointer */
#define SLOT100_T8_PIN                                        15U   /*!< PORT pin number */

#define SLOT100_T10_PORT                                      COMPRESS_GPIO2   /*!< PORT peripheral base pointer */
#define SLOT100_T10_PIN                                       0U   /*!< PORT pin number */

#define SLOT100_T11_PORT                                      COMPRESS_GPIO7   /*!< PORT peripheral base pointer */
#define SLOT100_T11_PIN                                       1U   /*!< PORT pin number */

#define SLOT100_T12_PORT                                      COMPRESS_GPIO2   /*!< PORT peripheral base pointer */
#define SLOT100_T12_PIN                                       2U   /*!< PORT pin number */

#define SLOT100_T13_PORT                                      COMPRESS_GPIO2   /*!< PORT peripheral base pointer */
#define SLOT100_T13_PIN                                       3U   /*!< PORT pin number */

#define SLOT100_T15_PORT                                      COMPRESS_GPIO2   /*!< PORT peripheral base pointer */
#define SLOT100_T15_PIN                                       4U   /*!< PORT pin number */

#define SLOT100_T16_PORT                                      COMPRESS_GPIO2   /*!< PORT peripheral base pointer */
#define SLOT100_T16_PIN                                       5U   /*!< PORT pin number */

#define SLOT100_T17_PORT                                      COMPRESS_GPIO2   /*!< PORT peripheral base pointer */
#define SLOT100_T17_PIN                                       6U   /*!< PORT pin number */

#define SLOT100_T18_PORT                                      COMPRESS_GPIO2   /*!< PORT peripheral base pointer */
#define SLOT100_T18_PIN                                       7U   /*!< PORT pin number */

#define SLOT100_T19_PORT                                      COMPRESS_GPIO2   /*!< PORT peripheral base pointer */
#define SLOT100_T19_PIN                                       8U   /*!< PORT pin number */

#define SLOT100_T20_PORT                                      COMPRESS_GPIO2   /*!< PORT peripheral base pointer */
#define SLOT100_T20_PIN                                       9U   /*!< PORT pin number */

#define SLOT100_T21_PORT                                      COMPRESS_GPIO2   /*!< PORT peripheral base pointer */
#define SLOT100_T21_PIN                                       10U   /*!< PORT pin number */

