RoboMaster/ArduinoCore-imxrt/variants/ai_hub/source/slot_factory_test.c
#define SLOT100_T22_PORT                                      COMPRESS_GPIO2   /*!< PORT peripheral base pointer */
#define SLOT100_T22_PIN                                       11U   /*!< PORT pin number */

#define SLOT100_T23_PORT                                      COMPRESS_GPIO2   /*!< PORT peripheral base pointer */
#define SLOT100_T23_PIN                                       12U   /*!< PORT pin number */

#define SLOT100_T24_PORT                                      COMPRESS_GPIO2   /*!< PORT peripheral base pointer */
#define SLOT100_T24_PIN                                       13U   /*!< PORT pin number */

#define SLOT100_T25_PORT                                      COMPRESS_GPIO2   /*!< PORT peripheral base pointer */
#define SLOT100_T25_PIN                                       14U   /*!< PORT pin number */

#define SLOT100_T26_PORT                                      COMPRESS_GPIO2   /*!< PORT peripheral base pointer */
#define SLOT100_T26_PIN                                       15U   /*!< PORT pin number */

#define SLOT100_T27_PORT                                      COMPRESS_GPIO2   /*!< PORT peripheral base pointer */
#define SLOT100_T27_PIN                                       16U   /*!< PORT pin number */

#define SLOT100_T28_PORT                                      COMPRESS_GPIO2   /*!< PORT peripheral base pointer */
#define SLOT100_T28_PIN                                       17U   /*!< PORT pin number */

#define SLOT100_T29_PORT                                      COMPRESS_GPIO2   /*!< PORT peripheral base pointer */
#define SLOT100_T29_PIN                                       18U   /*!< PORT pin number */

#define SLOT100_T30_PORT                                      COMPRESS_GPIO2   /*!< PORT peripheral base pointer */
#define SLOT100_T30_PIN                                       19U   /*!< PORT pin number */

#define SLOT100_T32_PORT                                      COMPRESS_GPIO3   /*!< PORT peripheral base pointer */
#define SLOT100_T32_PIN                                       21U   /*!< PORT pin number */

#define SLOT100_T33_PORT                                      COMPRESS_GPIO4   /*!< PORT peripheral base pointer */
#define SLOT100_T33_PIN                                       8U   /*!< PORT pin number */

#define SLOT100_T34_PORT                                      COMPRESS_GPIO4   /*!< PORT peripheral base pointer */
#define SLOT100_T34_PIN                                       19U   /*!< PORT pin number */

#define SLOT100_T35_PORT                                      COMPRESS_GPIO4   /*!< PORT peripheral base pointer */
#define SLOT100_T35_PIN                                       20U   /*!< PORT pin number */

#define SLOT100_T36_PORT                                      COMPRESS_GPIO3   /*!< PORT peripheral base pointer */
#define SLOT100_T36_PIN                                       24U   /*!< PORT pin number */

#define SLOT100_T37_PORT                                      COMPRESS_GPIO1   /*!< PORT peripheral base pointer */
#define SLOT100_T37_PIN                                       27U   /*!< PORT pin number */

#define SLOT100_T38_PORT                                      COMPRESS_GPIO4   /*!< PORT peripheral base pointer */
#define SLOT100_T38_PIN                                       23U   /*!< PORT pin number */

#define SLOT100_T39_PORT                                      COMPRESS_GPIO4   /*!< PORT peripheral base pointer */
#define SLOT100_T39_PIN                                       24U   /*!< PORT pin number */

#define SLOT100_T40_PORT                                      COMPRESS_GPIO4   /*!< PORT peripheral base pointer */
#define SLOT100_T40_PIN                                       25U   /*!< PORT pin number */

#define SLOT100_T41_PORT                                      COMPRESS_GPIO1   /*!< PORT peripheral base pointer */
#define SLOT100_T41_PIN                                       3U   /*!< PORT pin number */

#define SLOT100_T42_PORT                                      COMPRESS_GPIO4   /*!< PORT peripheral base pointer */
#define SLOT100_T42_PIN                                       11U   /*!< PORT pin number */

#define SLOT100_T43_PORT                                      COMPRESS_GPIO4   /*!< PORT peripheral base pointer */
#define SLOT100_T43_PIN                                       12U   /*!< PORT pin number */

#define SLOT100_T44_PORT                                      COMPRESS_GPIO4   /*!< PORT peripheral base pointer */
#define SLOT100_T44_PIN                                       13U   /*!< PORT pin number */

#define SLOT100_T46_PORT                                      COMPRESS_GPIO1   /*!< PORT peripheral base pointer */
#define SLOT100_T46_PIN                                       18U   /*!< PORT pin number */

#define SLOT100_T47_PORT                                      COMPRESS_GPIO1   /*!< PORT peripheral base pointer */
#define SLOT100_T47_PIN                                       19U   /*!< PORT pin number */

#define SLOT100_T48_PORT                                      COMPRESS_GPIO1   /*!< PORT peripheral base pointer */
#define SLOT100_T48_PIN                                       20U   /*!< PORT pin number */

#define SLOT100_T49_PORT                                      COMPRESS_GPIO1   /*!< PORT peripheral base pointer */
#define SLOT100_T49_PIN                                       21U   /*!< PORT pin number */

#define SLOT100_T53_PORT                                      COMPRESS_GPIO3   /*!< PORT peripheral base pointer */
#define SLOT100_T53_PIN                                       6U   /*!< PORT pin number */

#define SLOT100_T54_PORT                                      COMPRESS_GPIO3   /*!< PORT peripheral base pointer */
#define SLOT100_T54_PIN                                       7U   /*!< PORT pin number */

#define SLOT100_T56_PORT                                      COMPRESS_GPIO3   /*!< PORT peripheral base pointer */
#define SLOT100_T56_PIN                                       8U   /*!< PORT pin number */

