RoboMaster/ArduinoCore-imxrt/variants/ai_hub/source/slot_factory_test.c
#define SLOT100_T57_PORT                                      COMPRESS_GPIO4   /*!< PORT peripheral base pointer */
#define SLOT100_T57_PIN                                       26U   /*!< PORT pin number */

#define SLOT100_T59_PORT                                      COMPRESS_GPIO4   /*!< PORT peripheral base pointer */
#define SLOT100_T59_PIN                                       0U   /*!< PORT pin number */

#define SLOT100_T60_PORT                                      COMPRESS_GPIO4   /*!< PORT peripheral base pointer */
#define SLOT100_T60_PIN                                       1U   /*!< PORT pin number */

#define SLOT100_T61_PORT                                      COMPRESS_GPIO4   /*!< PORT peripheral base pointer */
#define SLOT100_T61_PIN                                       2U   /*!< PORT pin number */

#define SLOT100_T62_PORT                                      COMPRESS_GPIO4   /*!< PORT peripheral base pointer */
#define SLOT100_T62_PIN                                       3U   /*!< PORT pin number */

#define SLOT100_T63_PORT                                      COMPRESS_GPIO4   /*!< PORT peripheral base pointer */
#define SLOT100_T63_PIN                                       4U   /*!< PORT pin number */

#define SLOT100_T64_PORT                                      COMPRESS_GPIO4   /*!< PORT peripheral base pointer */
#define SLOT100_T64_PIN                                       5U   /*!< PORT pin number */

#define SLOT100_T65_PORT                                      COMPRESS_GPIO4   /*!< PORT peripheral base pointer */
#define SLOT100_T65_PIN                                       6U   /*!< PORT pin number */

#define SLOT100_T66_PORT                                      COMPRESS_GPIO4   /*!< PORT peripheral base pointer */
#define SLOT100_T66_PIN                                       7U   /*!< PORT pin number */

#define SLOT100_T67_PORT                                      COMPRESS_GPIO4   /*!< PORT peripheral base pointer */
#define SLOT100_T67_PIN                                       9U   /*!< PORT pin number */

#define SLOT100_T68_PORT                                      COMPRESS_GPIO3   /*!< PORT peripheral base pointer */
#define SLOT100_T68_PIN                                       11U   /*!< PORT pin number */

#define SLOT100_T69_PORT                                      COMPRESS_GPIO4   /*!< PORT peripheral base pointer */
#define SLOT100_T69_PIN                                       29U   /*!< PORT pin number */

#define SLOT100_T70_PORT                                      COMPRESS_GPIO3   /*!< PORT peripheral base pointer */
#define SLOT100_T70_PIN                                       10U   /*!< PORT pin number */

#define SLOT100_T71_PORT                                      COMPRESS_GPIO3   /*!< PORT peripheral base pointer */
#define SLOT100_T71_PIN                                       9U   /*!< PORT pin number */

#define SLOT100_T73_PORT                                      COMPRESS_GPIO2   /*!< PORT peripheral base pointer */
#define SLOT100_T73_PIN                                       26U   /*!< PORT pin number */

#define SLOT100_T74_PORT                                      COMPRESS_GPIO2   /*!< PORT peripheral base pointer */
#define SLOT100_T74_PIN                                       25U   /*!< PORT pin number */

#define SLOT100_T75_PORT                                      COMPRESS_GPIO2   /*!< PORT peripheral base pointer */
#define SLOT100_T75_PIN                                       27U   /*!< PORT pin number */

#define SLOT100_T76_PORT                                      COMPRESS_GPIO2   /*!< PORT peripheral base pointer */
#define SLOT100_T76_PIN                                       20U   /*!< PORT pin number */

#define SLOT100_T77_PORT                                      COMPRESS_GPIO2   /*!< PORT peripheral base pointer */
#define SLOT100_T77_PIN                                       21U   /*!< PORT pin number */

#define SLOT100_T78_PORT                                      COMPRESS_GPIO2   /*!< PORT peripheral base pointer */
#define SLOT100_T78_PIN                                       22U   /*!< PORT pin number */

#define SLOT100_T79_PORT                                      COMPRESS_GPIO2   /*!< PORT peripheral base pointer */
#define SLOT100_T79_PIN                                       23U   /*!< PORT pin number */

#define SLOT100_T80_PORT                                      COMPRESS_GPIO2   /*!< PORT peripheral base pointer */
#define SLOT100_T80_PIN                                       24U   /*!< PORT pin number */

#define SLOT100_T82_PORT                                      COMPRESS_GPIO3   /*!< PORT peripheral base pointer */
#define SLOT100_T82_PIN                                       26U   /*!< PORT pin number */

#define SLOT100_T83_PORT                                      COMPRESS_GPIO3   /*!< PORT peripheral base pointer */
#define SLOT100_T83_PIN                                       27U   /*!< PORT pin number */

#define SLOT100_T85_PORT                                      COMPRESS_GPIO4   /*!< PORT peripheral base pointer */
#define SLOT100_T85_PIN                                       22U   /*!< PORT pin number */

#define SLOT100_T86_PORT                                      COMPRESS_GPIO4   /*!< PORT peripheral base pointer */
#define SLOT100_T86_PIN                                       21U   /*!< PORT pin number */

#define SLOT100_T87_PORT                                      COMPRESS_GPIO3   /*!< PORT peripheral base pointer */
#define SLOT100_T87_PIN                                       19U   /*!< PORT pin number */

#define SLOT100_T88_PORT                                      COMPRESS_GPIO4   /*!< PORT peripheral base pointer */
#define SLOT100_T88_PIN                                       31U   /*!< PORT pin number */

#define SLOT100_T89_PORT                                      COMPRESS_GPIO3   /*!< PORT peripheral base pointer */
#define SLOT100_T89_PIN                                       18U   /*!< PORT pin number */

#define SLOT100_T90_PORT                                      COMPRESS_GPIO4   /*!< PORT peripheral base pointer */
#define SLOT100_T90_PIN                                       17U   /*!< PORT pin number */

