RoboMaster/ArduinoCore-imxrt/variants/ai_hub/source/slot_factory_test.c
#define SLOT100_T91_PORT                                      COMPRESS_GPIO4   /*!< PORT peripheral base pointer */
#define SLOT100_T91_PIN                                       18U   /*!< PORT pin number */

#define SLOT100_T92_PORT                                      COMPRESS_GPIO4   /*!< PORT peripheral base pointer */
#define SLOT100_T92_PIN                                       10U   /*!< PORT pin number */

#define SLOT100_T93_PORT                                      COMPRESS_GPIO4   /*!< PORT peripheral base pointer */
#define SLOT100_T93_PIN                                       14U   /*!< PORT pin number */

#define SLOT100_T94_PORT                                      COMPRESS_GPIO4   /*!< PORT peripheral base pointer */
#define SLOT100_T94_PIN                                       15U   /*!< PORT pin number */

#define SLOT100_T95_PORT                                      COMPRESS_GPIO4   /*!< PORT peripheral base pointer */
#define SLOT100_T95_PIN                                       16U   /*!< PORT pin number */

#define SLOT100_T96_PORT                                      COMPRESS_GPIO4   /*!< PORT peripheral base pointer */
#define SLOT100_T96_PIN                                       30U   /*!< PORT pin number */

#define SLOT100_T97_PORT                                      COMPRESS_GPIO3   /*!< PORT peripheral base pointer */
#define SLOT100_T97_PIN                                       20U   /*!< PORT pin number */

#define SLOT100_T98_PORT                                      COMPRESS_GPIO4   /*!< PORT peripheral base pointer */
#define SLOT100_T98_PIN                                       27U   /*!< PORT pin number */

#define SLOT100_T99_PORT                                      COMPRESS_GPIO4   /*!< PORT peripheral base pointer */
#define SLOT100_T99_PIN                                       28U   /*!< PORT pin number */


/* Private typedef -----------------------------------------------------------*/
/**
 * @brief RT1064官方库提供的GPIO索引是int32类型，使用int8替代压缩
 *
 */
typedef enum
{
    COMPRESS_GPIO1,
    COMPRESS_GPIO2,
    COMPRESS_GPIO3,
    COMPRESS_GPIO4,
    //COMPRESS_GPIO5,
    //COMPRESS_GPIO6,
    COMPRESS_GPIO7,
}compress_gpio_e;

#pragma pack(push, 1)

/**
 * @brief 测试GPIO对
 *
 */
typedef struct
{
    compress_gpio_e input_compress_gpio;
    uint8_t         input_pin;

    compress_gpio_e output_compress_gpio;
    uint8_t         output_pin;
}gpio_test_pair;

#pragma pack(pop)
/* Private macro -------------------------------------------------------------*/
/* Extern variables ----------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/

/* 14Pin插槽GPIO 测试对 */
gpio_test_pair slot_14_test_pair[] =
{
    {SLOT14_T1_PORT, SLOT14_T1_PIN, SLOT14_T6_PORT,  SLOT14_T6_PIN},
    {SLOT14_T2_PORT, SLOT14_T2_PIN, SLOT14_T6_PORT,  SLOT14_T6_PIN},
    {SLOT14_T3_PORT, SLOT14_T3_PIN, SLOT14_T8_PORT,  SLOT14_T8_PIN},
    {SLOT14_T4_PORT, SLOT14_T4_PIN, SLOT14_T9_PORT,  SLOT14_T9_PIN},
    {SLOT14_T5_PORT, SLOT14_T5_PIN, SLOT14_T10_PORT, SLOT14_T10_PIN}
};

/* 100Pin插槽GPIO 测试对 */
gpio_test_pair slot_100_test_pair[] =
{
    {SLOT100_T5_PORT,  SLOT100_T5_PIN,  SLOT100_T6_PORT,   SLOT100_T6_PIN},
    {SLOT100_T7_PORT,  SLOT100_T7_PIN,  SLOT100_T56_PORT,  SLOT100_T56_PIN},
    {SLOT100_T8_PORT,  SLOT100_T8_PIN,  SLOT100_T57_PORT,  SLOT100_T57_PIN},

    {SLOT100_T59_PORT, SLOT100_T59_PIN, SLOT100_T10_PORT,  SLOT100_T10_PIN}, /* 陪测板中T59,T60,T10三个IO接在了一起*/
    {SLOT100_T60_PORT, SLOT100_T60_PIN, SLOT100_T10_PORT,  SLOT100_T10_PIN},

    {SLOT100_T11_PORT, SLOT100_T11_PIN, SLOT100_T61_PORT,  SLOT100_T61_PIN},
    {SLOT100_T12_PORT, SLOT100_T12_PIN, SLOT100_T62_PORT,  SLOT100_T62_PIN},
    {SLOT100_T13_PORT, SLOT100_T13_PIN, SLOT100_T63_PORT,  SLOT100_T63_PIN},
    {SLOT100_T15_PORT, SLOT100_T15_PIN, SLOT100_T64_PORT,  SLOT100_T64_PIN},
    {SLOT100_T16_PORT, SLOT100_T16_PIN, SLOT100_T65_PORT,  SLOT100_T65_PIN},
    {SLOT100_T17_PORT, SLOT100_T17_PIN, SLOT100_T66_PORT,  SLOT100_T66_PIN},
    {SLOT100_T18_PORT, SLOT100_T18_PIN, SLOT100_T67_PORT,  SLOT100_T67_PIN},
    {SLOT100_T19_PORT, SLOT100_T19_PIN, SLOT100_T68_PORT,  SLOT100_T68_PIN},
    {SLOT100_T20_PORT, SLOT100_T20_PIN, SLOT100_T69_PORT,  SLOT100_T69_PIN},
    {SLOT100_T21_PORT, SLOT100_T21_PIN, SLOT100_T70_PORT,  SLOT100_T70_PIN},
    {SLOT100_T22_PORT, SLOT100_T22_PIN, SLOT100_T71_PORT,  SLOT100_T71_PIN},
    {SLOT100_T23_PORT, SLOT100_T23_PIN, SLOT100_T73_PORT,  SLOT100_T73_PIN},
    {SLOT100_T24_PORT, SLOT100_T24_PIN, SLOT100_T74_PORT,  SLOT100_T74_PIN},
    {SLOT100_T25_PORT, SLOT100_T25_PIN, SLOT100_T75_PORT,  SLOT100_T75_PIN},
    {SLOT100_T26_PORT, SLOT100_T26_PIN, SLOT100_T76_PORT,  SLOT100_T76_PIN},
    {SLOT100_T27_PORT, SLOT100_T27_PIN, SLOT100_T77_PORT,  SLOT100_T77_PIN},
    {SLOT100_T28_PORT, SLOT100_T28_PIN, SLOT100_T78_PORT,  SLOT100_T78_PIN},
    {SLOT100_T29_PORT, SLOT100_T29_PIN, SLOT100_T79_PORT,  SLOT100_T79_PIN},
    {SLOT100_T30_PORT, SLOT100_T30_PIN, SLOT100_T80_PORT,  SLOT100_T80_PIN},
    {SLOT100_T32_PORT, SLOT100_T32_PIN, SLOT100_T82_PORT,  SLOT100_T82_PIN},
    {SLOT100_T33_PORT, SLOT100_T33_PIN, SLOT100_T83_PORT,  SLOT100_T83_PIN},
    {SLOT100_T34_PORT, SLOT100_T34_PIN, SLOT100_T85_PORT,  SLOT100_T85_PIN},
    {SLOT100_T35_PORT, SLOT100_T35_PIN, SLOT100_T86_PORT,  SLOT100_T86_PIN},
    {SLOT100_T36_PORT, SLOT100_T36_PIN, SLOT100_T87_PORT,  SLOT100_T87_PIN},
    {SLOT100_T37_PORT, SLOT100_T37_PIN, SLOT100_T88_PORT,  SLOT100_T88_PIN},
    {SLOT100_T38_PORT, SLOT100_T38_PIN, SLOT100_T89_PORT,  SLOT100_T89_PIN},
    {SLOT100_T39_PORT, SLOT100_T39_PIN, SLOT100_T90_PORT,  SLOT100_T90_PIN},
    {SLOT100_T40_PORT, SLOT100_T40_PIN, SLOT100_T91_PORT,  SLOT100_T91_PIN},
    {SLOT100_T41_PORT, SLOT100_T41_PIN, SLOT100_T92_PORT,  SLOT100_T92_PIN},
    {SLOT100_T42_PORT, SLOT100_T42_PIN, SLOT100_T93_PORT,  SLOT100_T93_PIN},
    {SLOT100_T43_PORT, SLOT100_T43_PIN, SLOT100_T94_PORT,  SLOT100_T94_PIN},
    {SLOT100_T44_PORT, SLOT100_T44_PIN, SLOT100_T95_PORT,  SLOT100_T95_PIN},
    {SLOT100_T46_PORT, SLOT100_T46_PIN, SLOT100_T96_PORT,  SLOT100_T96_PIN},
    {SLOT100_T47_PORT, SLOT100_T47_PIN, SLOT100_T97_PORT,  SLOT100_T97_PIN},
    {SLOT100_T48_PORT, SLOT100_T48_PIN, SLOT100_T98_PORT,  SLOT100_T98_PIN},
    {SLOT100_T49_PORT, SLOT100_T49_PIN, SLOT100_T99_PORT,  SLOT100_T99_PIN},
    {SLOT100_T53_PORT, SLOT100_T53_PIN, SLOT100_T54_PORT,  SLOT100_T54_PIN}
};

