RoboMaster/ArduinoCore-imxrt/variants/ai_hub/source/slot_factory_test.c
/* Private function prototypes -----------------------------------------------*/
static GPIO_Type* gpio_uncompass(compress_gpio_e compress_gpio);
static void gpio_init_group(gpio_test_pair *group, uint16_t unit_num);
static int gpio_test_group(gpio_test_pair *group, uint16_t unit_num);

/* Exported functions --------------------------------------------------------*/
/**
 * @brief 测试PCBA上14pin的插槽，需要接入14Pin配测板.
 *
 * @return int 返回测试结果 0:测试成功 -1:测试失败
 */
int slot_14pin_test(void)
{
    uint8_t pair_num = sizeof(slot_14_test_pair) / sizeof(gpio_test_pair);

    gpio_init_group(slot_14_test_pair, pair_num);

    /* IO Mux设置, 由MCUXpresso Config Tools自动生成 */
    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B1_06_GPIO1_IO22, 0U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B1_07_GPIO1_IO23, 0U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B1_12_GPIO1_IO28, 0U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B1_13_GPIO1_IO29, 0U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B1_14_GPIO1_IO30, 0U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B1_15_GPIO1_IO31, 0U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B1_02_GPIO3_IO02, 0U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B1_04_GPIO3_IO04, 0U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B1_05_GPIO3_IO05, 0U);
    IOMUXC_GPR->GPR26 = ((IOMUXC_GPR->GPR26 &
    (~(SLOT14_BOARD_INITPINS_IOMUXC_GPR_GPR26_GPIO_MUX1_GPIO_SEL_MASK)))
      | IOMUXC_GPR_GPR26_GPIO_MUX1_GPIO_SEL(0x00U)
    );
  IOMUXC_GPR->GPR28 = ((IOMUXC_GPR->GPR28 &
    (~(SLOT14_BOARD_INITPINS_IOMUXC_GPR_GPR28_GPIO_MUX3_GPIO_SEL_MASK)))
      | IOMUXC_GPR_GPR28_GPIO_MUX3_GPIO_SEL(0x00U)
    );

    /* 开始测试 */
    return gpio_test_group(slot_14_test_pair, pair_num);
}

/**
 * @brief 测试PCBA上100pin的插槽，需要接入100Pin配测板.
 *
 * @return int 返回测试结果 0:测试成功 -1:测试失败
 */
int slot_100pin_test(void)
{
    uint8_t pair_num = sizeof(slot_100_test_pair) / sizeof(gpio_test_pair);

    /* 初始化GPIO */
    gpio_init_group(slot_100_test_pair, pair_num);

    /* IO Mux设置, 由MCUXpresso Config Tools自动生成 */
    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B0_00_GPIO1_IO00, 0U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B0_03_GPIO1_IO03, 0U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B0_12_GPIO1_IO12, 0U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B0_13_GPIO1_IO13, 0U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B0_14_GPIO1_IO14, 0U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B0_15_GPIO1_IO15, 0U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B1_00_GPIO1_IO16, 0U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B1_01_GPIO1_IO17, 0U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B1_02_GPIO1_IO18, 0U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B1_03_GPIO1_IO19, 0U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B1_04_GPIO1_IO20, 0U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B1_05_GPIO1_IO21, 0U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B1_06_GPIO1_IO22, 0U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B1_07_GPIO1_IO23, 0U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B1_09_GPIO1_IO25, 0U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B1_11_GPIO1_IO27, 0U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_B0_00_GPIO2_IO00, 0U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_B0_01_GPIO2_IO01, 0U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_B0_02_GPIO2_IO02, 0U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_B0_03_GPIO2_IO03, 0U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_B0_04_GPIO2_IO04, 0U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_B0_05_GPIO2_IO05, 0U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_B0_06_GPIO2_IO06, 0U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_B0_07_GPIO2_IO07, 0U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_B0_08_GPIO2_IO08, 0U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_B0_09_GPIO2_IO09, 0U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_B0_10_GPIO2_IO10, 0U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_B0_11_GPIO2_IO11, 0U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_B0_12_GPIO2_IO12, 0U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_B0_13_GPIO2_IO13, 0U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_B0_14_GPIO2_IO14, 0U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_B0_15_GPIO2_IO15, 0U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_B1_00_GPIO2_IO16, 0U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_B1_01_GPIO2_IO17, 0U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_B1_02_GPIO2_IO18, 0U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_B1_03_GPIO2_IO19, 0U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_B1_04_GPIO2_IO20, 0U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_B1_05_GPIO2_IO21, 0U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_B1_06_GPIO2_IO22, 0U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_B1_07_GPIO2_IO23, 0U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_B1_08_GPIO2_IO24, 0U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_B1_09_GPIO2_IO25, 0U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_B1_10_GPIO2_IO26, 0U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_B1_11_GPIO2_IO27, 0U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_B1_12_GPIO2_IO28, 0U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_B1_13_GPIO2_IO29, 0U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_B1_14_GPIO2_IO30, 0U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_B1_15_GPIO2_IO31, 0U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_00_GPIO4_IO00, 0U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_01_GPIO4_IO01, 0U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_02_GPIO4_IO02, 0U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_03_GPIO4_IO03, 0U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_04_GPIO4_IO04, 0U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_05_GPIO4_IO05, 0U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_06_GPIO4_IO06, 0U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_07_GPIO4_IO07, 0U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_09_GPIO4_IO09, 0U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_11_GPIO4_IO11, 0U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_12_GPIO4_IO12, 0U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_13_GPIO4_IO13, 0U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_17_GPIO4_IO17, 0U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_18_GPIO4_IO18, 0U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_23_GPIO4_IO23, 0U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_24_GPIO4_IO24, 0U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_25_GPIO4_IO25, 0U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_26_GPIO4_IO26, 0U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_27_GPIO4_IO27, 0U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_29_GPIO4_IO29, 0U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_30_GPIO4_IO30, 0U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_31_GPIO4_IO31, 0U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_32_GPIO3_IO18, 0U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_38_GPIO3_IO24, 0U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_40_GPIO3_IO26, 0U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_41_GPIO3_IO27, 0U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B1_00_GPIO3_IO00, 0U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B1_04_GPIO3_IO04, 0U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B1_05_GPIO3_IO05, 0U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B1_06_GPIO3_IO06, 0U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B1_07_GPIO3_IO07, 0U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B1_08_GPIO3_IO08, 0U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B1_09_GPIO3_IO09, 0U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B1_10_GPIO3_IO10, 0U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B1_11_GPIO3_IO11, 0U);

    IOMUXC_GPR->GPR26 = ((IOMUXC_GPR->GPR26 &
        (~(SLOT100_BOARD_INITPINS_IOMUXC_GPR_GPR26_GPIO_MUX1_GPIO_SEL_MASK)))
        | IOMUXC_GPR_GPR26_GPIO_MUX1_GPIO_SEL(0x00U)
        );
    IOMUXC_GPR->GPR27 = ((IOMUXC_GPR->GPR27 &
        (~(SLOT100_BOARD_INITPINS_IOMUXC_GPR_GPR27_GPIO_MUX2_GPIO_SEL_MASK)))
        | IOMUXC_GPR_GPR27_GPIO_MUX2_GPIO_SEL(0x02U)
        );
    IOMUXC_GPR->GPR28 = ((IOMUXC_GPR->GPR28 &
        (~(SLOT100_BOARD_INITPINS_IOMUXC_GPR_GPR28_GPIO_MUX3_GPIO_SEL_MASK)))
        | IOMUXC_GPR_GPR28_GPIO_MUX3_GPIO_SEL(0x00U)
        );
    IOMUXC_GPR->GPR29 = ((IOMUXC_GPR->GPR29 &
        (~(SLOT100_BOARD_INITPINS_IOMUXC_GPR_GPR29_GPIO_MUX4_GPIO_SEL_MASK)))
        | IOMUXC_GPR_GPR29_GPIO_MUX4_GPIO_SEL(0x00U)
        );

