RoboMaster/ArduinoCore-imxrt/variants/ai_hub/source/slot_factory_test.c
    /* 开始测试 */
    return gpio_test_group(slot_100_test_pair, pair_num);
}


/* Private functions ---------------------------------------------------------*/
/**
 * @brief 将8位被压缩的GPIO转换回官方库32位的GPIO结构体
 *
 * @param compress_gpio
 * @return GPIO_Type*
 */
static GPIO_Type* gpio_uncompass(compress_gpio_e compress_gpio)
{
    switch(compress_gpio)
    {
        case COMPRESS_GPIO1: return GPIO1;
        case COMPRESS_GPIO2: return GPIO2;
        case COMPRESS_GPIO3: return GPIO3;
        case COMPRESS_GPIO4: return GPIO4;
        //case COMPRESS_GPIO5: return GPIO5;
        //case COMPRESS_GPIO6: return GPIO6;
        case COMPRESS_GPIO7: return GPIO7;
    }
}

/**
 * @brief 初始化GPIO
 *
 * @param group 需要初始化IO测试对列表
 * @param unit_num IO测试对的数量
 */
static void gpio_init_group(gpio_test_pair *group, uint16_t unit_num)
{
    /* 初始化GPIO */
    gpio_pin_config_t gpio_config;
    gpio_config.outputLogic = 0U;
    gpio_config.interruptMode = kGPIO_NoIntmode;

    for(int i = 0; i < unit_num; i++)
    {
        gpio_config.direction = kGPIO_DigitalInput;
        GPIO_PinInit(gpio_uncompass(group[i].input_compress_gpio),
                     group[i].input_pin,
                     &gpio_config);
        gpio_config.direction = kGPIO_DigitalOutput;
        GPIO_PinInit(gpio_uncompass(group[i].output_compress_gpio),
                     group[i].output_pin,
                     &gpio_config);
    }
}

/**
 * @brief 测试IO对
 *
 * @param group 需要初始化IO测试对列表
 * @param unit_num IO测试对的数量
 * @return int 返回测试结果 0:测试成功 -1:测试失败
 */
static int gpio_test_group(gpio_test_pair *group, uint16_t unit_num)
{
    for(int i = 0; i < unit_num; i++)
    {
        GPIO_WritePinOutput(gpio_uncompass(group[i].output_compress_gpio), group[i].output_pin, 1);
    }

    osDelay(2);

    for(int i = 0; i < unit_num; i++)
    {
        if(!GPIO_ReadPinInput(gpio_uncompass(group[i].input_compress_gpio), group[i].input_pin))
        {
            return -1;
        }
    }

    for(int i = 0; i < unit_num; i++)
    {
        GPIO_WritePinOutput(gpio_uncompass(group[i].output_compress_gpio), group[i].output_pin, 0);
    }

    osDelay(2);

    for(int i = 0; i < unit_num; i++)
    {
        if(GPIO_ReadPinInput(gpio_uncompass(group[i].input_compress_gpio), group[i].input_pin))
        {
            return -1;
        }
    }

    return 0;
}
